SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_rcu.c
/*!
    \file    gd32e23x_hal_rcu.c
    \brief   RCU driver
    
    \version 2019-03-14, V1.0.0, firmware for GD32E23x
*/

/*
    Copyright (c) 2019, GigaDevice Semiconductor Inc.

    All rights reserved.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32e23x_hal.h"

#define _CKOUT_GPIO_CLK_ENABLE()       hal_rcu_periph_clk_enable(RCU_GPIOA)
#define _CKOUT_GPIO_PORT               GPIOA
#define _CKOUT_GPIO_PIN                GPIO_PIN_8
#define _RCU_CKSYSSRC_INDEX(x)         (x)

hal_rcu_irq_struct rcu_irq = {NULL, NULL, NULL, NULL, NULL, NULL, NULL};

/* RCU system clock oscillator stable flag */
static const rcu_flag_enum _rcu_stab_flag[] = {
    RCU_FLAG_IRC8MSTB,
    RCU_FLAG_HXTALSTB,
    RCU_FLAG_PLLSTB
};

/* RCU system clock source timeout */
static const uint32_t _rcu_timeout[] = {
    RCU_IRC8M_TIMEOUT,
    RCU_HXTAL_TIMEOUT,
    RCU_PLL_TIMEOUT
};

/* RCU system clock source */
static const uint32_t _rcu_scss[] = {
    RCU_SCSS_IRC8M,
    RCU_SCSS_HXTAL,
    RCU_SCSS_PLL
};

/*!
    \brief      deinitialize the RCU
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hal_rcu_deinit(void)
{
    rcu_deinit();

    SystemCoreClock = IRC8M_VALUE;
}

/*!
    \brief      initialize the RCU structure
    \param[in]  rcu_struct_type: the RCU structure type, can be one of following values:
      \arg        HAL_RCU_CLK_STRUCT: RCU clock structure type
      \arg        HAL_RCU_OSCI_STRUCT: RCU oscillator structure type
      \arg        HAL_RCU_PERIPHCLK_STRUCT: RCU peripheral clock structure type
    \param[in]  p_struct: pointer of the RCU structure
    \param[out] none
    \retval     none
*/
void hal_rcu_struct_init(hal_rcu_struct_type_enum rcu_struct_type, void *p_struct)
{
    switch(rcu_struct_type){
    case HAL_RCU_CLK_STRUCT:
        /* initialize rcu clock structure with the default values */
        ((hal_rcu_clk_struct *)p_struct)->clock_type = RCU_CLKTYPE_NONE;
        ((hal_rcu_clk_struct *)p_struct)->ahbclk_divider = RCU_SYSCLK_AHBDIV1;
        ((hal_rcu_clk_struct *)p_struct)->apb1clk_divider = RCU_AHBCLK_APB1DIV1;
        ((hal_rcu_clk_struct *)p_struct)->apb2clk_divider = RCU_AHBCLK_APB2DIV1;
        ((hal_rcu_clk_struct *)p_struct)->sysclk_source = RCU_SYSCLK_SRC_IRC8M;
        break;

    case HAL_RCU_OSCI_STRUCT:
        /* initialize rcu oscillator structure with the default values */
        ((hal_rcu_osci_struct *)p_struct)->hxtal.need_configure = DISABLE;
        ((hal_rcu_osci_struct *)p_struct)->hxtal.state = RCU_OSC_NONE;
        ((hal_rcu_osci_struct *)p_struct)->lxtal.need_configure = DISABLE;
        ((hal_rcu_osci_struct *)p_struct)->lxtal.state = RCU_OSC_NONE;
        ((hal_rcu_osci_struct *)p_struct)->irc28m.need_configure = DISABLE;
        ((hal_rcu_osci_struct *)p_struct)->irc28m.adjust_value = 0U;
        ((hal_rcu_osci_struct *)p_struct)->irc28m.state = RCU_OSC_NONE;
        ((hal_rcu_osci_struct *)p_struct)->irc8m.need_configure = DISABLE;
        ((hal_rcu_osci_struct *)p_struct)->irc8m.adjust_value = 0U;
        ((hal_rcu_osci_struct *)p_struct)->irc8m.state = RCU_OSC_NONE;
        ((hal_rcu_osci_struct *)p_struct)->irc40k.need_configure = DISABLE;
        ((hal_rcu_osci_struct *)p_struct)->irc40k.state = RCU_OSC_NONE;
        ((hal_rcu_osci_struct *)p_struct)->pll.need_configure = DISABLE;
        ((hal_rcu_osci_struct *)p_struct)->pll.state = RCU_OSC_NONE;
        break;

    case HAL_RCU_PERIPHCLK_STRUCT:
        /* initialize rcu peripheral clock structure with the default values */
        ((hal_rcu_periphclk_struct *)p_struct)->periph_clock_type = RCU_PERIPH_CLKTYPE_NONE;
        ((hal_rcu_periphclk_struct *)p_struct)->adc_clock_source = RCU_ADCCK_IRC28M_DIV2;
        ((hal_rcu_periphclk_struct *)p_struct)->rtc_clock_source = RCU_RTC_CLKSRC_NONE;
        ((hal_rcu_periphclk_struct *)p_struct)->usart0_clock_source = RCU_USART0_CLKSRC_IRC8M;
        break;

    default:
        break;
    }
}

/*!
    \brief      enable the peripherals clock
    \param[in]  periph: RCU peripherals
                  the argument could be selected from enumeration <rcu_periph_enum>
    \param[out] none
    \retval     none
*/
void hal_rcu_periph_clk_enable(rcu_periph_enum periph)
{
    rcu_periph_clock_enable(periph);
}

/*!
    \brief      disable the peripherals clock
    \param[in]  periph: RCU peripherals
                  the argument could be selected from enumeration <rcu_periph_enum>
    \param[out] none
    \retval     none
*/
void hal_rcu_periph_clk_disable(rcu_periph_enum periph)
{
    rcu_periph_clock_disable(periph);
}

/*!
    \brief      initialize the RCU extended peripherals(RTC, Usart0 and ADC) clocks
    \param[in]  periph_clk: the pointer of peripheral clock structure
                  periph_clock_type(member): can be a combination of the following values
                    RCU_PERIPH_CLKTYPE_NONE: no clock type
                    RCU_PERIPH_CLKTYPE_RTC: RTC clock type
                    RCU_PERIPH_CLKTYPE_USART0: usart0 clock type
                    RCU_PERIPH_CLKTYPE_ADC: ADC clock type
                  rtc_clock_source(member): only one parameter can be selected which is shown as below
                    RCU_RTC_CLKSRC_NONE: RTC has no clock source
                    RCU_RTC_CLKSRC_LXTAL: RTC select LXTAL as clock source
                    RCU_RTC_CLKSRC_IRC40K: RTC select IRC40K as clock source
                    RCU_RTC_CLKSRC_HXTAL_DIV32: RTC select HXTAL/32 as clock source
                  usart0_clock_source(member): only one parameter can be selected which is shown as below
                    RCU_USART_CLKSRC_APB2: USART0 select APB2 as clock source
                    RCU_USART_CLKSRC_SYS: USART0 select SYSCLK as clock source
                    RCU_USART_CLKSRC_LXTAL: USART0 select LXTAL as clock source
                    RCU_USART_CLKSRC_IRC8M: USART0 select IRC8M as clock source
                  adc_clock_source: ADC clock source
                    the argument could be selected from enumeration <rcu_adc_clock_enum>
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_TIMEOUT, details refer to gd32e23x_hal.h
*/
int32_t hal_rcu_periph_clock_config(hal_rcu_periphclk_struct *periph_clk)
{
    uint32_t backup_reg = 0U;
    FlagStatus pwr_state = RESET;

