SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_rcu.c
#if (1 == HAL_PARAMETER_CHECK)

    if(NULL == rcu_osci){
        HAL_DEBUGE("parameter [rcu_osci] is a NULL pointer.");

        return HAL_ERR_ADDRESS;
    }

#endif /* 1 == HAL_PARAMETER_CHECK */

    /* clear all rcu configuration */
    rcu_deinit();

    /* configure HXTAL */
    if(ENABLE == rcu_osci->hxtal.need_configure){
        /* it is not allowed to be disabled when the HXTAL is used as system clock or clock source of PLL */
        if((RCU_SCSS_HXTAL == rcu_system_clock_source_get()) || \
             ((RCU_SCSS_PLL == rcu_system_clock_source_get()) && \
              (RCU_PLLSRC_HXTAL == (RCU_CFG0 & RCU_CFG0_PLLSEL)))){
            if((RESET != (RCU_CTL0 & RCU_CTL0_HXTALSTB)) && (RCU_OSC_OFF == rcu_osci->hxtal.state)){
                return HAL_ERR_VAL;
            }
        } else {
            /* configure the new HXTAL state */
            switch(rcu_osci->hxtal.state){
            case RCU_OSC_OFF:
                rcu_osci_off(RCU_HXTAL);
                rcu_osci_bypass_mode_disable(RCU_HXTAL);
                break;
            case RCU_OSC_ON:
                rcu_osci_on(RCU_HXTAL);
                break;
            case RCU_OSC_BYPASS:
                rcu_osci_off(RCU_HXTAL);
                rcu_osci_bypass_mode_enable(RCU_HXTAL);
                rcu_osci_on(RCU_HXTAL);
                break;
            default:
                break;
            }

            if(RCU_OSC_OFF != rcu_osci->hxtal.state){
                if(ERROR == rcu_osci_stab_wait(RCU_HXTAL)){
                    return HAL_ERR_TIMEOUT;
                }
            } else {
                uint32_t tick_start = hal_basetick_count_get();

                /* wait till HXTAL is disable */
                while(RESET != (RCU_CTL0 & RCU_CTL0_HXTALSTB)){
                    if(SET == hal_basetick_timeout_check(tick_start, RCU_HXTAL_TIMEOUT)){
                        return HAL_ERR_TIMEOUT;
                    }
                }
            }
        }
    }

    /* configure LXTAL */
    if(ENABLE == rcu_osci->lxtal.need_configure){
        if(RESET == (RCU_APB1EN & RCU_APB1EN_PMUEN)){
            rcu_periph_clock_enable(RCU_PMU);

            pwr_state = SET;
        }

        /* update LXTAL configuration in backup domain control register */
        if(RESET == (PMU_CTL & PMU_CTL_BKPWEN)){
            uint32_t tick_start = 0U;

            /* enable write access to backup domain */
            pmu_backup_write_enable();

            tick_start = hal_basetick_count_get();

            while(RESET == (PMU_CTL & PMU_CTL_BKPWEN)){
                if(SET == hal_basetick_timeout_check(tick_start, RCU_BP_TIMEOUT)){
                    return HAL_ERR_TIMEOUT;
                }
            }
        }

        /* configure the new LXTAL state */
        switch(rcu_osci->lxtal.state){
        case RCU_OSC_OFF:
            rcu_osci_off(RCU_LXTAL);
            rcu_osci_bypass_mode_disable(RCU_LXTAL);
            break;
        case RCU_OSC_ON:
            rcu_osci_on(RCU_LXTAL);
            break;
        case RCU_OSC_BYPASS:
            rcu_osci_off(RCU_LXTAL);
            rcu_osci_bypass_mode_enable(RCU_LXTAL);
            rcu_osci_on(RCU_LXTAL);
            break;
        default:
            break;
        }

        if(RCU_OSC_OFF != rcu_osci->lxtal.state){
            if(ERROR == rcu_osci_stab_wait(RCU_LXTAL)){
                return HAL_ERR_TIMEOUT;
            }
        }else{
            /* wait till LXTAL is disabled */
            uint32_t tick_start = hal_basetick_count_get();

            while(RESET != (RCU_BDCTL & RCU_BDCTL_LXTALSTB)){
                if(SET == hal_basetick_timeout_check(tick_start, RCU_LXTAL_TIMEOUT)){
                    return HAL_ERR_TIMEOUT;
                }
            }
        }

        if(SET == pwr_state){
            rcu_periph_clock_disable(RCU_PMU);

            pwr_state = RESET;
        }
    }

    /* configure IRC8M */
    if(ENABLE == rcu_osci->irc8m.need_configure){
        /* it is not allowed to be disabled when IRC8M is used as system clock or as PLL source */
        if((RCU_SCSS_IRC8M == rcu_system_clock_source_get()) || \
             ((RCU_SCSS_PLL == rcu_system_clock_source_get()) && \
              (RCU_PLLSRC_IRC8M_DIV2 == (RCU_CFG0 & RCU_CFG0_PLLSEL)))){
            if((RESET != (RCU_CTL0 & RCU_CTL0_IRC8MSTB)) && (RCU_OSC_OFF == rcu_osci->irc8m.state)){
                return HAL_ERR_VAL;
            }else{
                if (rcu_osci->irc8m.adjust_value){
                    /* adjusts the IRC8M calibration value */
                    rcu_irc8m_adjust_value_set(rcu_osci->irc8m.adjust_value);
                }
            }
        }else{
            if(RCU_OSC_OFF != rcu_osci->irc8m.state){
                rcu_osci_on(RCU_IRC8M);

                /* wait till IRC8M is stable */
                if(ERROR == rcu_osci_stab_wait(RCU_IRC8M)){
                    return HAL_ERR_TIMEOUT;
                }

                if (rcu_osci->irc8m.adjust_value){
                    /* adjusts the IRC8M calibration value */
                    rcu_irc8m_adjust_value_set(rcu_osci->irc8m.adjust_value);
                }
            }else{
                uint32_t tick_start = 0U;

                rcu_osci_off(RCU_IRC8M);

                tick_start = hal_basetick_count_get();

                /* wait till IRC8M is disabled */
                while(RESET != (RCU_CTL0 & RCU_CTL0_IRC8MSTB)){
                    if(SET == hal_basetick_timeout_check(tick_start, RCU_IRC8M_TIMEOUT)){
                        return HAL_ERR_TIMEOUT;
                    }
                }
            }
        }
    }

    /* configure IRC28M */
    if(ENABLE == rcu_osci->irc28m.need_configure){
        /* set the IRC28M new state */
        if(RCU_OSC_ON == rcu_osci->irc28m.state){
            RCU_CFG2 &= ~RCU_CFG2_ADCSEL;

            rcu_osci_on(RCU_IRC28M);

            /* wait till IRC28M is stable */
            if(ERROR == rcu_osci_stab_wait(RCU_IRC28M)){
                return HAL_ERR_TIMEOUT;
            }

            if(rcu_osci->irc28m.adjust_value){
                /* adjusts the IRC28M calibration value */
                rcu_irc28m_adjust_value_set(rcu_osci->irc28m.adjust_value);
            }
        }else if(RCU_OSC_ADCCTL == rcu_osci->irc28m.state){
            RCU_CFG2 &= ~RCU_CFG2_ADCSEL;
            
            rcu_osci_on(RCU_IRC28M);
            
            /* wait till IRC28M is stable */
            if(ERROR == rcu_osci_stab_wait(RCU_IRC28M)){
                return HAL_ERR_TIMEOUT;
            }

            if(rcu_osci->irc28m.adjust_value){
                /* adjusts the IRC28M calibration value */
                rcu_irc28m_adjust_value_set(rcu_osci->irc28m.adjust_value);
            }
        }else{
            uint32_t tick_start = 0U;

            RCU_CFG2 |= RCU_CFG2_ADCSEL;

            rcu_osci_off(RCU_IRC28M);

            tick_start = hal_basetick_count_get();

            /* wait till IRC28M is disabled */
            while(RESET != (RCU_CTL1 & RCU_CTL1_IRC28MSTB)){
                if(SET == hal_basetick_timeout_check(tick_start, RCU_IRC28M_TIMEOUT)){
                    return HAL_ERR_TIMEOUT;
                }
            }
        }
    }

    /* configure IRC40K */
    if(ENABLE == rcu_osci->irc40k.need_configure){
        /* set the IRC40K new state */
        if(RCU_OSC_OFF != rcu_osci->irc40k.state){
            rcu_osci_on(RCU_IRC40K);

            /* wait till IRC40K is stable */
            if(ERROR == rcu_osci_stab_wait(RCU_IRC40K)){
                return HAL_ERR_TIMEOUT;
            }
        }else{
            uint32_t tick_start = 0U;

