SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_rcu.c
            rcu_osci_off(RCU_IRC40K);

            tick_start = hal_basetick_count_get();

            /* wait till IRC40K is disabled */
            while(RESET != (RCU_RSTSCK & RCU_RSTSCK_IRC40KSTB)){
                if(SET == hal_basetick_timeout_check(tick_start, RCU_IRC40K_TIMEOUT)){
                    return HAL_ERR_TIMEOUT;
                }
            }
        }
    }

    /* configure PLL */
    if(ENABLE == rcu_osci->pll.need_configure){
        /* check if the PLL is used as system clock or not */
        if(RCU_OSC_NONE != rcu_osci->pll.state){
            if(RCU_SCSS_PLL != rcu_system_clock_source_get()){
                uint32_t tick_start = 0U;

                if(RCU_OSC_ON == rcu_osci->pll.state){
                    rcu_osci_off(RCU_PLL_CK);

                    tick_start = hal_basetick_count_get();

                    /* wait till PLL is disabled */
                    while(RESET != (RCU_CTL0 & RCU_CTL0_PLLSTB)){
                        if(SET == hal_basetick_timeout_check(tick_start, RCU_PLL_TIMEOUT)){
                            return HAL_ERR_TIMEOUT;
                        }
                    }

                    /* configure the PLL */
                    rcu_hxtal_prediv_config(rcu_osci->pll.pre_div);
                    rcu_pll_config(rcu_osci->pll.pll_source, rcu_osci->pll.pll_mul);

                    rcu_osci_on(RCU_PLL_CK);

                    /* wait till PLL is stable */
                    if(ERROR == rcu_osci_stab_wait(RCU_PLL_CK)){
                        return HAL_ERR_TIMEOUT;
                    }
                }else{
                    rcu_osci_off(RCU_PLL_CK);

                    tick_start = hal_basetick_count_get();

                    /* wait till PLL is disabled */
                    while(RESET != (RCU_CTL0 & RCU_CTL0_PLLSTB)){
                        if(SET == hal_basetick_timeout_check(tick_start, RCU_PLL_TIMEOUT)){
                            return HAL_ERR_TIMEOUT;
                        }
                    }
                }
            }else{
                return HAL_ERR_VAL;
            }
        }
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      get the RCU oscillators configuration
    \param[in]  rcu_osci: the pointer of the RCU oscillators structure
                  hxtal: HXTAL status structure
                    need_cofigure: configure flag, can be ENABLE or DISABLE
                    status: the argument could be selected from enumeration <hal_rcu_osc_state_enum>
                  lxtal: LXTAL status structure
                    need_cofigure: configure flag, can be ENABLE or DISABLE
                    status: the argument could be selected from enumeration <hal_rcu_osc_state_enum>
                  irc28m: IRC28M status structure
                    need_cofigure: configure flag, can be ENABLE or DISABLE
                    calibration_value: calibration value
                    status: the argument could be selected from enumeration <hal_rcu_osc_state_enum>
                  irc8m: IRC8M status structure
                    need_cofigure: configure flag, can be ENABLE or DISABLE
                    calibration_value: calibration value
                    status: the argument could be selected from enumeration <hal_rcu_osc_state_enum>
                  irc40k: IRC40K status structure
                    need_cofigure: configure flag, can be ENABLE or DISABLE
                    status: the argument could be selected from enumeration <hal_rcu_osc_state_enum>
                  pll: PLL status structure
                    need_cofigure: configure flag, can be ENABLE or DISABLE
                    status: the argument could be selected from enumeration <hal_rcu_osc_state_enum>
                    pll_source: RCU_PLL_SRC_HXTAL, RCU_PLL_SRC_IRC8M_DIV2
                    pre_div: the argument could be selected from enumeration <hal_rcu_pll_prediv_enum>
                    pll_mul: the argument could be selected from enumeration <hal_rcu_pll_mul_enum>
    \param[out] none
    \retval     none
*/
void hal_rcu_osci_config_get(hal_rcu_osci_struct *rcu_osci)
{
#if (1 == HAL_PARAMETER_CHECK)

    if(NULL == rcu_osci){
        HAL_DEBUGE("parameter [rcu_osci] is a NULL pointer.");

        return;
    }

#endif /* 1 == HAL_PARAMETER_CHECK */

    /* configure all the oscillator type */
    rcu_osci->hxtal.need_configure = ENABLE;
    rcu_osci->lxtal.need_configure = ENABLE;
    rcu_osci->irc8m.need_configure = ENABLE;
    rcu_osci->irc28m.need_configure = ENABLE;
    rcu_osci->irc40k.need_configure = ENABLE;
    rcu_osci->pll.need_configure = ENABLE;

    /* get the current HXTAL state */
    if(RESET != (RCU_CTL0 & RCU_CTL0_HXTALBPS)){
        rcu_osci->hxtal.state = RCU_OSC_BYPASS;
    }else if(RESET != (RCU_CTL0 & RCU_CTL0_HXTALEN)){
        rcu_osci->hxtal.state = RCU_OSC_ON;
    }else{
        rcu_osci->hxtal.state = RCU_OSC_OFF;
    }

    /* get the current LXTAL state */
    if(RESET != (RCU_BDCTL & RCU_BDCTL_LXTALBPS)){
        rcu_osci->lxtal.state = RCU_OSC_BYPASS;
    }else if(RESET != (RCU_BDCTL & RCU_BDCTL_LXTALEN)){
        rcu_osci->lxtal.state = RCU_OSC_ON;
    }else{
        rcu_osci->lxtal.state = RCU_OSC_OFF;
    }

    /* get the current IRC8M state and adjust value */
    if(RESET != (RCU_CTL0 & RCU_CTL0_IRC8MEN)){
        rcu_osci->irc8m.state = RCU_OSC_ON;
    }else{
        rcu_osci->irc8m.state = RCU_OSC_OFF;
    }

    rcu_osci->irc8m.adjust_value = (uint8_t)((RCU_CTL0 & RCU_CTL0_IRC8MCALIB) >> 8);

    /* get the current IRC28M state and adjust value */
    if(RESET == (RCU_CFG2 & RCU_CFG2_ADCSEL)){
        rcu_osci->irc28m.state = RCU_OSC_ADCCTL;
    }else{
        if(RESET != (RCU_CTL1 & RCU_CTL1_IRC28MEN)){
            rcu_osci->irc28m.state = RCU_OSC_ON;
        }else{
            rcu_osci->irc28m.state = RCU_OSC_OFF;
        }
    }

    rcu_osci->irc28m.adjust_value = (uint8_t)((RCU_CTL1 & RCU_CTL1_IRC28MCALIB) >> 8);

    /* get the current IRC40K state */
    if(RESET != (RCU_RSTSCK & RCU_RSTSCK_IRC40KEN)){
        rcu_osci->irc40k.state = RCU_OSC_ON;
    }else{
        rcu_osci->irc40k.state = RCU_OSC_OFF;
    }

    /* get the current PLL state */
    if(RESET != (RCU_CTL0 & RCU_CTL0_PLLEN)){
        rcu_osci->pll.state = RCU_OSC_ON;
    }else{
        rcu_osci->pll.state = RCU_OSC_OFF;
    }

