SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_rcu.c
    /* get the PLL parameters */
    rcu_osci->pll.pll_mul = (hal_rcu_pll_mul_enum)(RCU_CFG0 & RCU_CFG0_PLLMF);
    rcu_osci->pll.pll_source = (hal_rcu_pll_src_enum)(RCU_CFG0 & RCU_CFG0_PLLSEL);
    rcu_osci->pll.pre_div = (hal_rcu_pll_prediv_enum)(RCU_CFG0 & RCU_CFG0_PLLPREDV);
}

/*!
    \brief      configure the RCU clock
    \param[in]  rcu_clk: the pointer of the RCU clock structure
                  clock_type(member): can be a combination of the following values
                    RCU_CLKTYPE_NONE: no clock type
                    RCU_CLKTYPE_SYSCLK: system clock type
                    RCU_CLKTYPE_AHBCLK: AHB bus clock type
                    RCU_CLKTYPE_APB1CLK: APB1 bus clock type
                    RCU_CLKTYPE_APB2CLK: APB2 bus clock type
                  sysclk_source(member): can be one of the following values
                    RCU_SYSCLK_SRC_IRC8M: IRC8M as system clock source
                    RCU_SYSCLK_SRC_HXTAL: HXTAL as system clock source
                    RCU_SYSCLK_SRC_PLL: PLL as system clock source
                  ahbclk_divider(member): AHB clock divider
                    the argument could be selected from enumeration <hal_rcu_sysclk_ahbdiv_enum>
                  apb1clk_divider(member): APB1 clock divider
                    the argument could be selected from enumeration <hal_rcu_sysclk_apb1div_enum>
                  apb2clk_divider(member): APB2 clock divider
                    the argument could be selected from enumeration <hal_rcu_sysclk_apb2div_enum>
    \param[in]  fmc_wscnt: FMC wait state count
                  it depends on the AHB clock frequency, can be one of following values:
      \arg          WS_WSCNT_0: if AHB clock frequency <= 24MHz
      \arg          WS_WSCNT_1: if AHB clock frequency <= 48MHz
      \arg          WS_WSCNT_2: if AHB clock frequency <= 72MHz
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_TIMEOUT, details refer to gd32e23x_hal.h
    \note       user need compute the AHB clock freuuency before, then decide the fmc_wscnt value
*/
int32_t hal_rcu_clock_config(hal_rcu_clk_struct *rcu_clk, uint8_t fmc_wscnt)
{
#if (1 == HAL_PARAMETER_CHECK)

    if(NULL == rcu_clk){
        HAL_DEBUGE("parameter [rcu_clk] is a NULL pointer.");

        return HAL_ERR_ADDRESS;
    }

    if(fmc_wscnt > 2) {
        HAL_DEBUGE("parameter [fmc_wscnt] is invalid.");

        return HAL_ERR_VAL;
    }

    if(rcu_clk->clock_type > RCU_CLKTYPE_MAX){
        HAL_DEBUGE("parameter member [rcu_clk->clock_type] is invalid.");

        return HAL_ERR_VAL;
    }

#endif /* 1 == HAL_PARAMETER_CHECK */

    /* to correctly use flash memory, the count of wait states (WSCNT) must be 
       correctly programmed according to the frequency of the CPU clock (AHBCLK) of the device. */

    if(fmc_wscnt > (FMC_WS & FMC_WS_WSCNT)){
        /* If AHB increase, configure flash wait state count before */
        fmc_wscnt_set(fmc_wscnt);

        if((FMC_WS & FMC_WS_WSCNT) != fmc_wscnt){
            return HAL_ERR_VAL;
        }
    }

    /* configure system clock */
    if(RCU_CLKTYPE_SYSCLK == (rcu_clk->clock_type & RCU_CLKTYPE_SYSCLK)){
        uint32_t tick_start = 0U;
        uint32_t time_out = _rcu_timeout[_RCU_CKSYSSRC_INDEX(rcu_clk->sysclk_source)];

        if(RESET == rcu_flag_get(_rcu_stab_flag[_RCU_CKSYSSRC_INDEX(rcu_clk->sysclk_source)])){
            return HAL_ERR_VAL;
        }

        /* configure the system clock source */
        rcu_system_clock_source_config(CFG0_SCS(rcu_clk->sysclk_source));

        tick_start = hal_basetick_count_get();

        /* wait till system clock source is stable */
        while(_rcu_scss[_RCU_CKSYSSRC_INDEX(rcu_clk->sysclk_source)] != rcu_system_clock_source_get()){
            if(SET == hal_basetick_timeout_check(tick_start, time_out)){
                return HAL_ERR_TIMEOUT;
            }
        }
    }

    /* configure AHB bus clock */
    if(RCU_CLKTYPE_AHBCLK == (rcu_clk->clock_type & RCU_CLKTYPE_AHBCLK)){
        /* configure AHB clock */
        rcu_ahb_clock_config(rcu_clk->ahbclk_divider);
    }

    if(fmc_wscnt < (FMC_WS & FMC_WS_WSCNT)){
        /* If AHB decrease, configure flash wait state count after */
        fmc_wscnt_set(fmc_wscnt);

        if((FMC_WS & FMC_WS_WSCNT) != fmc_wscnt){
            return HAL_ERR_VAL;
        }
    }

    /* configure APB1 bus clock */
    if(RCU_CLKTYPE_APB1CLK == (rcu_clk->clock_type & RCU_CLKTYPE_APB1CLK)){
        rcu_apb1_clock_config(rcu_clk->apb1clk_divider);
    }

    /* configure APB2 bus clock */
    if(RCU_CLKTYPE_APB2CLK == (rcu_clk->clock_type & RCU_CLKTYPE_APB2CLK)){
        rcu_apb2_clock_config(rcu_clk->apb2clk_divider);
    }

    /* update the SystemCoreClock global variable */
    SystemCoreClock = rcu_clock_freq_get(CK_SYS);

    /* configure the source of time base considering new system clocks settings */
    hal_basetick_init(g_basetick_source);

    return HAL_ERR_NONE;
}

/*!
    \brief      get the RCU clock configuration
    \param[in]  rcu_clk: the pointer of the RCU clock structure
                  clock_type(member): can be a combination of the following values
                    RCU_CLKTYPE_NONE: no clock type
                    RCU_CLKTYPE_SYSCLK: system clock type
                    RCU_CLKTYPE_AHBCLK: AHB bus clock type
                    RCU_CLKTYPE_APB1CLK: APB1 bus clock type
                    RCU_CLKTYPE_APB2CLK: APB2 bus clock type
                  sysclk_source(member): can be one of the following values
                    RCU_SYSCLK_SRC_IRC8M: IRC8M as system clock source
                    RCU_SYSCLK_SRC_HXTAL: HXTAL as system clock source
                    RCU_SYSCLK_SRC_PLL: PLL as system clock source
                  ahbclk_divider(member): AHB clock divider
                    the argument could be selected from enumeration <hal_rcu_sysclk_ahbdiv_enum>
                  apb1clk_divider(member): APB1 clock divider
                    the argument could be selected from enumeration <hal_rcu_sysclk_apb1div_enum>
                  apb2clk_divider(member): APB2 clock divider
                    the argument could be selected from enumeration <hal_rcu_sysclk_apb2div_enum>
    \param[in]  fmc_wscnt: pointer of FMC wait state count
    \param[out] none
    \retval     none
*/
void hal_rcu_clock_config_get(hal_rcu_clk_struct *rcu_clk, uint8_t *fmc_wscnt)
{
#if (1 == HAL_PARAMETER_CHECK)

    if(NULL == rcu_clk){
        HAL_DEBUGE("parameter [rcu_clk] is a NULL pointer.");

        return;
    }

