SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_rcu.c
    if(NULL == fmc_wscnt){
        HAL_DEBUGE("parameter [fmc_wscnt] is a NULL pointer.");

        return;
    }

#endif /* 1 == HAL_PARAMETER_CHECK */

    /* get all clock type configuration */
    rcu_clk->clock_type = RCU_CLKTYPE_SYSCLK | RCU_CLKTYPE_AHBCLK | RCU_CLKTYPE_APB1CLK | RCU_CLKTYPE_APB2CLK;
    rcu_clk->sysclk_source = (hal_rcu_sysclk_src_enum)(RCU_CFG0 & RCU_CFG0_SCS);
    rcu_clk->ahbclk_divider = (hal_rcu_sysclk_ahbdiv_enum)(RCU_CFG0 & RCU_CFG0_AHBPSC);
    rcu_clk->apb1clk_divider = (hal_rcu_ahbclk_apbldiv_enum)(RCU_CFG0 & RCU_CFG0_APB1PSC);
    rcu_clk->apb2clk_divider = (hal_rcu_ahbclk_apb2div_enum)(RCU_CFG0 & RCU_CFG0_APB2PSC);

    /* get flash wait status configuration */
    *fmc_wscnt = FMC_WS & FMC_WS_WSCNT;
}

/*!
    \brief      configure the clock out to output on CKOUT pin
    \param[in]  ckout_src: clock out source
                  the argument could be selected from enumeraion <hal_rcu_ckout_src_enum>
    \param[in]  ckout_div: clock out divider
                  the argument could be selected from enumeraion <hal_rcu_ckout_div_enum>
    \param[out] none
    \retval     
*/
void hal_rcu_clock_out_config(hal_rcu_ckout_src_enum ckout_src, hal_rcu_ckout_div_enum ckout_div)
{
    uint32_t clkout_src = 0U;

    hal_gpio_init_struct gpio_init_struct;

    _CKOUT_GPIO_CLK_ENABLE();

    /* configure clock out GPIO pin */
    gpio_init_struct.mode = HAL_GPIO_MODE_AF_PP;
    gpio_init_struct.ospeed = HAL_GPIO_OSPEED_50MHZ;
    gpio_init_struct.pull = HAL_GPIO_PULL_NONE;
    gpio_init_struct.af = HAL_GPIO_AF_0;

    hal_gpio_init(_CKOUT_GPIO_PORT, _CKOUT_GPIO_PIN, &gpio_init_struct);

    if(RCU_CKOUT_SRC_CKPLL_DIV1 == ckout_src){
        clkout_src = RCU_CKOUTSRC_CKPLL_DIV1;
    }else{
        clkout_src = CFG0_CKOUTSEL(ckout_src);
    }

    /* clock out configuration */
    rcu_ckout_config(clkout_src, ckout_div);
}

/*!
    \brief      set user-defined interrupt callback function, 
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  prcu_irq: pointer of RCU interrupt handler structure
    \param[out] none
    \retval     none
*/
void hal_rcu_irq_handle_set(hal_rcu_irq_struct *prcu_irq)
{
#if (1 == HAL_PARAMETER_CHECK)

    if(NULL == prcu_irq){
        HAL_DEBUGE("parameter [prcu_irq] is a NULL pointer.");

        return;
    }

#endif /* 1 == HAL_PARAMETER_CHECK */

    /* HXTAL stable interrupt handler set */
    if(NULL != prcu_irq->hxtal_stable_handle){
        rcu_irq.hxtal_stable_handle = prcu_irq->hxtal_stable_handle;

        rcu_interrupt_enable(RCU_INT_HXTALSTB);
    }else{
        rcu_irq.hxtal_stable_handle = NULL;

        rcu_interrupt_disable(RCU_INT_HXTALSTB);
    }

    /* IRC28M stable interrupt handler set */
    if(NULL != prcu_irq->irc28m_stable_handle){
        rcu_irq.irc28m_stable_handle = prcu_irq->irc28m_stable_handle;

        rcu_interrupt_enable(RCU_INT_IRC28MSTB);
    }else{
        rcu_irq.irc28m_stable_handle = NULL;

        rcu_interrupt_disable(RCU_INT_IRC28MSTB);
    }

    /* IRC40K stable interrupt handler set */
    if(NULL != prcu_irq->irc40k_stable_handle){
        rcu_irq.irc40k_stable_handle = prcu_irq->irc40k_stable_handle;

        rcu_interrupt_enable(RCU_INT_IRC40KSTB);
    }else{
        rcu_irq.irc40k_stable_handle = NULL;

        rcu_interrupt_disable(RCU_INT_IRC40KSTB);
    }

    /* IRC8M stable interrupt handler set */
    if(NULL != prcu_irq->irc8m_stable_handle){
        rcu_irq.irc8m_stable_handle = prcu_irq->irc8m_stable_handle;

        rcu_interrupt_enable(RCU_INT_IRC8MSTB);
    }else{
        rcu_irq.irc8m_stable_handle = NULL;

        rcu_interrupt_disable(RCU_INT_IRC8MSTB);
    }

    /* LXTAL stable interrupt handler set */
    if(NULL != prcu_irq->lxtal_stable_handle){
        rcu_irq.lxtal_stable_handle = prcu_irq->lxtal_stable_handle;

        rcu_interrupt_enable(RCU_INT_LXTALSTB);
    }else{
        rcu_irq.lxtal_stable_handle = NULL;

        rcu_interrupt_disable(RCU_INT_LXTALSTB);
    }

    /* PLL stable interrupt handler set */
    if(NULL != prcu_irq->pll_stable_handle){
        rcu_irq.pll_stable_handle = prcu_irq->pll_stable_handle;

        rcu_interrupt_enable(RCU_INT_PLLSTB);
    }else{
        rcu_irq.pll_stable_handle = NULL;

        rcu_interrupt_disable(RCU_INT_PLLSTB);
    }

    /* HXTAL stuck interrupt handler set */
    if(NULL != prcu_irq->hxtal_stuck_handle){
        rcu_irq.hxtal_stuck_handle = prcu_irq->hxtal_stuck_handle;
    }
}

/*!
    \brief      reset all user-defined interrupt callback function, 
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hal_rcu_irq_handle_all_reset(void)
{
    /* reset all interrupt handler */
    rcu_irq.hxtal_stable_handle = NULL;
    rcu_irq.hxtal_stuck_handle = NULL;
    rcu_irq.irc28m_stable_handle = NULL;
    rcu_irq.irc40k_stable_handle = NULL;
    rcu_irq.irc8m_stable_handle = NULL;
    rcu_irq.lxtal_stable_handle = NULL;
    rcu_irq.pll_stable_handle = NULL;
}

/*!
    \brief      RCU interrupt handler content function,which is merely used in RCU_handler
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hal_rcu_irq(void)
{
    /* IRC40K stable interrupt handler */
    if(SET == rcu_interrupt_flag_get(RCU_INT_FLAG_IRC40KSTB)){
        rcu_interrupt_flag_clear(RCU_INT_FLAG_IRC40KSTB_CLR);
        if(NULL != rcu_irq.irc40k_stable_handle){
            rcu_irq.irc40k_stable_handle(NULL);
        }
    }

    /* IRC8M stable interrupt handler */
    if(SET == rcu_interrupt_flag_get(RCU_INT_FLAG_IRC8MSTB)){
        rcu_interrupt_flag_clear(RCU_INT_FLAG_IRC8MSTB_CLR);
        if(NULL != rcu_irq.irc8m_stable_handle){
            rcu_irq.irc8m_stable_handle(NULL);
        }
    }

    /* IRC28M stable interrupt handler */
    if(SET == rcu_interrupt_flag_get(RCU_INT_FLAG_IRC28MSTB)){
        rcu_interrupt_flag_clear(RCU_INT_FLAG_IRC28MSTB_CLR);
        if(NULL != rcu_irq.irc28m_stable_handle){
            rcu_irq.irc28m_stable_handle(NULL);
        }
    }

    /* LXTAL stable interrupt handler */
    if(SET == rcu_interrupt_flag_get(RCU_INT_FLAG_LXTALSTB)){
        rcu_interrupt_flag_clear(RCU_INT_FLAG_LXTALSTB_CLR);
        if(NULL != rcu_irq.lxtal_stable_handle){
            rcu_irq.lxtal_stable_handle(NULL);
        }
    }

    /* HXTAL stable interrupt handler */
    if(SET == rcu_interrupt_flag_get(RCU_INT_FLAG_HXTALSTB)){
        rcu_interrupt_flag_clear(RCU_INT_FLAG_HXTALSTB_CLR);
        if(NULL != rcu_irq.hxtal_stable_handle){
            rcu_irq.hxtal_stable_handle(NULL);
        }
    }

    /* PLL stable interrupt handler */
    if(SET == rcu_interrupt_flag_get(RCU_INT_FLAG_PLLSTB)){
        rcu_interrupt_flag_clear(RCU_INT_FLAG_PLLSTB_CLR);
        if(NULL != rcu_irq.pll_stable_handle){
            rcu_irq.pll_stable_handle(NULL);
        }
    }

    /* HXTAL stuck interrupt handler */
    if(SET == rcu_interrupt_flag_get(RCU_INT_FLAG_CKM)){
        rcu_interrupt_flag_clear(RCU_INT_FLAG_CKM_CLR);
        if(NULL != rcu_irq.hxtal_stuck_handle){
            rcu_irq.hxtal_stuck_handle(NULL);
        }
    }
}
